docs/appendix/appendix-7.md

Appendix 7 - Sample PDF Validation Service Request
=====================================================

```xml
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
	<S:Body>
		<ns2:validateDocument xmlns:ns2="http://ws.dss.esig.europa.eu/">
			<document>
				<bytes>
					JVBERi0xLjQKJcOkw7zDtsOfCjIgMCBvYmoKPDwvTGVuZ3RoIDMgMCBSL0ZpbHRlci9GbGF0ZURlY29kZT4+
					CnN0cmVhbQp4nC3JuwpCQQwE0D5fMbXgmsR9whJQ0MLuQsBC7Hx0grfx910fDAzDHA6CFz3B4LFSS0FRo4SK+
					UrHBR4/G5nvtHVKeVApMWT4Bau9QBR+O3UWW2pnNem8Nv1X5MTZautcvly5fe6Nnf1AO6eJJrwBHoMb7Qplbm
					RzdHJlYW0KZW5kb2JqCgozIDAgb2JqCjExNgplbmRvYmoKCjUgMCBvYmoKPDwvTGVuZ3RoIDYgMCBSL0ZpbHR
					lci9GbGF0ZURlY29kZS9MZW5ndGgxIDE4NTI4Pj4Kc3RyZWFtCnic7Xt7eJTF9fCZed+9ZW9vbrtJdrPvu7vZ3
					Hazu+QCJESyIQkBAhIgYEKJJCSBRC5ZNgmIBYlViwQV6v1SAduiVvDHJoAGtJpatdXWQm9WbRVsbestLW3RTy
					tkvzOzy83a/r7f83zP8/3xdd+cOWfOOTNz5syZM/Nukv7IQBcYYBAECHWsbQ+7jPoUAPgJAEnp2NCvWN4ssSF
					9CkDz5srwqrWRA2+4AXTPAKiGV63ZtHL73R+OA5jDAJZPu7vaO5/r/oEJILcb+5jcjYwFE5s0WN+L9Zzutf3XF
					qmWeLH+AtZ9a3o72j/IeSQL66exnrG2/dpwp+orKoA8LdaVde1ru355/UAy1vMBkk+Ee/v6AQ0FmPopk4cjXeE
					PXv4oAFCegTbUIY/gwz4GJNWsTgVRpdZodUnw/+dHdTvCXJAR7MJdgGsZewfhXYT3JubEzqpWg3vimtgpIRWVn0
					gAgAfugT2QA6fJJHgexmAOPALV0Ah3QT0ch4Nggk3kxyCCG2rhMfAQGSjMBCtRwf3wBiyDCPwBTkE+NMDbJAX7q
					YMwWKA89j6WDXBL7ChqJUEN/BccI2vIIgggPYv6iBdH3hkbAyvkx16NvY61h+APJCc2DLOQ+iMkQx5shW9AClwDr
					8TOoqU5sAIeJZvJ++CENtghlopDsdUwDY7Ar0gDUvNgk+p13RFYg62+TaxkLHYy9id4ViTQhT19DW5Bi0dgjPqFG
					tVeUCAXroAroR2lX4U3SCqZJIRiebEZsfuR+yj8jXrpS4IG7fDCbFgOt8HD6I3X4F34mOhJGXmI7MfnZ+TPqtf
					RtgYYgOtwbz2E3nsUDsBRMolMolZqRW9ZoQAWo2wn7MPxD8EJ0kBayBj5vrBPFZyoiqXF0mN/isWgEJrRwj3wfRzj
					DAmiDo4guIR+0SH2q4rP3YAz7IRvwgn4GdrxNvr9Y/iUFOLzDr2ebo1dFXss9ge0RQsyTIUFsBR6YQNshG/hqj
					4PL8BfyedUh5rHxRdV16lOx+5A3+bCDLR9Pmovwr534CqNwCg+r+Esk4mCs5hKriQLySqyk9xDRskb5A2qpk6
					6nn4gRIUfC78VJ6tUsQrsyQIOHNcNV0E3rsD16O07cL6PwYvwMkknuaQIZ/Qatv+ETqO1+HybHqdvCzcLO8Wz
					qq9PnJr4cOLz2BBoMMrq0Q8D8Dh64S/EgjYUkGtIH/k9Wr6LHhZMgiS4hTKhWmgSWoRbhLuEHwk/FSPifvFN
					1WxVu2q/pn1i3cTPYg2xm4BlCTXalQc+KIUpGD8rMZpWo31hfCKwGW6AIbgd4+UO2Av7cd7PwcvwK3gLPsIVA
					OJEm3tw9LUYdTeT2/G5nxwg3ycvkpfJO+QT9lAXPvl0Mq2iNXQmXUVvxucueoK+Rt8T7EKHsFUYxGe38KTwhgi
					iKMZUxfjMUu1QPar+sSZfM0uzQvuTs+PnCs+1nHt7AiayJr4ycc/E9yf+FFsS24T2e6AI/GjpNrTyfozBffg8j
					pH4JLyEufvX3Na/EUpUGPEZxI3R4MNVqyL1ZDY+88gCfBbjcxVZik87WUG68dlKBsnXyI3kJnIbuZs/9+Hc9pHv
					kifxeYocw+dX5CT5I/mA/I1iEFMBo9lD82iAluNMa2g9nU8X4rOK9uITphG6AVfoUXqIHqWvCamCRygS2oX1wv
					3CfwnPC78UPhOp6BMDYqW4RFwl3igeF38mvi5+rpJVdapu1W7V82qbulS9WH2N+ 6UznvXCVUIS2dxWJS0JnsTP
					ZgQewinFWEsbMhFXyOt5AxDCd8a1c9hG+  (Contentcs 
                    (Contents truncated for readability)
				</bytes>
				<name>/fixedpath/file.pdf</name>
				<absolutePath>/fixedpath/file.pdf</absolutePath>
				<mimeType>PDF</mimeType>
				<nextDocument></nextDocument>
			</document>
			<diagnosticDataToBeReturned>true</diagnosticDataToBeReturned>
		</ns2:validateDocument>
	</S:Body>
</S:Envelope>
```